# Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'caskroom/drivers'

# Where to store apps
cask_args appdir: '/Applications'

# Generic
brew 'mas'
cask 'setapp'

# Backup
brew 'mackup'

# Dev
brew 'git'
brew 'node'
brew 'ruby'
cask 'atom'
cask 'fork'

# Network
brew 'curl'
brew 'openssh'
brew 'openssl'
brew 'rsync'
brew 'wget'
cask 'transmission'

# Terminal
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
cask 'hyper'

# Security
cask 'gpg-suite'
mas '1Password 7', id: 1333542190

# Crypto
cask 'ganache'
cask 'ledger-live'

# Utility
cask 'appcleaner'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'archiver'
cask 'the-unarchiver'

# Web
cask 'firefox'
cask 'google-chrome'

# Image
cask 'sketch'
mas 'Pixave', id: 924891282

# Video
brew 'ffmpeg'
cask 'handbrake'
cask 'molotov'
cask 'iina'

# Game
cask 'steam'

# Communication
cask 'telegram'
cask 'keybase'
cask 'rocket-chat'
cask 'zoomus'

# Office
cask 'numi'
